cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

brew 'ack'
brew 'coreutils'
brew 'fasd'
brew 'git'
brew 'go'
brew 'grc'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'meteor'
brew 'mongo'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'python'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-syntax-highlighting'


cask '1password'
cask 'alfred'
cask 'atom'
cask 'dash'
cask 'deluge'
cask 'dropbox'
cask 'droplr'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'google-drive'
cask 'grandperspective'
cask 'helium'
cask 'hyper'
cask 'kindle'
cask 'nylas-mail'
cask 'private-internet-access'
cask 'rescuetime'
cask 'skype'
cask 'slack'
cask 'slicy'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'text-edit'
cask 'torbrowser'
cask 'transmit'
cask 'tripmode'
cask 'ulysses'
cask 'visual-studio-code'
cask 'vlc'

cask 'adobe-creative-cloud'
cask 'adobe-acrobat'
cask 'adobe-after-effects-cc'
cask 'adobe-bridge-cc'
cask 'adobe-illustrator-cc'
cask 'adobe-indesign-cc'
cask 'adobe-media-encoder-cc'
cask 'adobe-photoshop-lightroom'
cask 'adobe-photoshop-cc'
cask 'adobe-premiere-pro-cc'
