# Brewfile.apps: gui apps for every machine
mas 'Amphetamine', id: 937984704
mas 'System Color Picker', id: 1545870783

cask '1password'
cask 'alfred'
cask 'android-studio'
cask 'anki'
cask 'antigravity'
cask 'anythingllm'
cask 'anytype'
cask 'appcleaner'
cask 'arc'
cask 'bartender'
cask 'charles'
cask 'claude'
cask 'cleanshot'
cask 'cloudflare-warp'
cask 'contexts'
cask 'cursor'
cask 'devutils'
cask 'discord'
cask 'dropzone'
cask 'expo-orbit'
cask 'figma'
cask 'firefox'
cask 'ghostty'
cask 'google-chrome'
cask 'grandperspective'
cask 'homerow'
cask 'insomnia'
cask 'iterm2'
cask 'karabiner-elements'
cask 'linear'
cask 'lm-studio'
cask 'loom'
cask 'microsoft-edge'
cask 'miro'
cask 'ngrok'
cask 'notion'
cask 'ollama-app'
cask 'pop-app'
cask 'postico'
cask 'postman'
cask 'rectangle'
cask 'signal'
cask 'sip-app'
cask 'sitesucker-pro'
cask 'sizzy'
cask 'sketch'
cask 'slack'
cask 'stats'
cask 'sublime-text'
cask 'tailscale-app'
cask 'thebrowsercompany-dia'
cask 'tripmode'
cask 'visual-studio-code'
cask 'wispr-flow'
cask 'yaak'
cask 'zed'
cask 'zoom'
