cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

###### FORMULA ######
brew 'ack'
brew 'awk'
brew 'awscli'
brew 'certbot'
brew 'clojure'
brew 'cmake'
brew 'coreutils'
brew 'cowsay'
brew 'curl'
brew 'docker-compose'
brew 'elixir'
brew 'emojify'
brew 'erlang'
brew 'fasd'
brew 'ffmpeg'
brew 'fzf'
brew 'git'
brew 'go'
brew 'geoip'
brew 'grep'
brew 'hub'
brew 'htop'
brew 'httpd'
brew 'imagemagick'
brew 'java'
brew 'jenkins'
brew 'jp2a'
brew 'jq'
brew 'jupyter'
brew 'kotlin'
brew 'kubernetes-cli'
brew 'libgit2'
brew 'llvm'
brew 'lua'
brew 'make'
brew 'mas'
brew 'memcached'
brew 'mobile-shell'
brew 'mongocli'
brew 'mysql'
brew 'nginx'
brew 'openssl'
brew 'nmap'
brew 'node'
brew 'nvm'
brew 'perl'
brew 'pipenv'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'python'
brew 'r'
brew 'rabbitmq'
brew 'readline'
brew 'redis'
brew 'ripgrep'
brew 'rsync'
brew 'ruby'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'telnet'
brew 'tree'
brew 'tmux'
brew 'vim'
brew 'watchman'
brew 'webp'
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'zsh-syntax-highlighting'
# browse top packages at https://formulae.brew.sh/analytics/install-on-request/365d/

###### CASKS ######
cask 'visual-studio-code'
cask 'google-chrome'
cask 'slack'
cask 'iterm2'
cask 'spotify'
cask 'tidal'
cask 'around'
cask 'zoom'
cask 'loom'
cask 'alfred'
cask '1password'
cask 'firefox'
cask 'insomnia'
cask 'brave-browser'
cask 'notion'
cask 'grandperspective'
cask 'postman'
cask 'sketch'
cask 'sketchup-pro'
cask 'sip'
cask 'vlc'
cask 'freedom'
cask 'pop'
cask 'sitesucker-pro'
cask 'adobe-creative-cloud'
cask 'imazing'
cask 'charles'
cask 'karabiner-elements'
cask 'contexts'
cask 'pictogram'

##### Applications to install manually #####
# XCode
# Global Protect
# Adobe products through Creative Cloud - Lightroom, Photoshop, Illustrator


##### iOS Apps to maybe add
# Youtube
# Audible
# Overcast
# AllTrails
# Disney+
# HBOMax
# Google Maps
# Signal
# Mountain Project
# Google Sheets
# Venmo
# Robinhood
# Strava
# Coinbase
# Kindle
# Airbnb
