# These are the most important homebrew packages. At some point, you can run `sh config/fullBrew.sh`
# to install all of the other packages that are marginally useful
brew 'curl'
brew 'deno'
brew 'fasd'
brew 'git'
brew 'htop'
brew 'node'
brew 'pnpm'
brew 'ruby'
brew 'stripe/stripe-cli/stripe'
brew 'thefuck'
brew 'tree'
brew 'tmux'
brew 'uv'
brew 'vim'
brew 'watchman'
brew 'yarn'
brew 'zsh'
brew 'zsh-syntax-highlighting'

###### APPLICATIONS ######
cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'anki'
cask 'appcleaner'
cask 'around'
cask 'bartender'
cask 'charles'
cask 'cleanshot'
cask 'cheatsheet'
cask 'contexts'
cask 'downie'
cask 'dropzone'
cask 'firefox'
cask 'google-chrome'
cask 'grandperspective'
cask 'iina'
cask 'insomnia'
cask 'iterm2'
cask 'karabiner-elements'
cask 'kindle'
cask 'loom'
cask 'microsoft-edge'
cask 'permute'
cask 'pop'
cask 'postman'
cask 'rectangle'
cask 'signal'
cask 'sip'
cask 'sitesucker-pro'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'stats'
cask 'tidal'
cask 'tripmode'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'


##### Applications to install manually #####
# Notion
# XCode
# Global Protect
# Adobe Lightroom, Photoshop, Illustrator
# Sketchup Pro
# System Color Picker


##### iOS Apps to add
# Airbnb
# HBOMax
# Mountain Project
# Overcast
